My procedure:
1. Access the data (imdb files)
2. Make the algorithm for the quiz
3. Define the questions of the quiz:
4. Who is the main character of the film "X"
5. Who is the director of the film "X"
6. Define the structure of the quiz:
7. The quiz consist in 3 levels of difficulty that are easy, medium and hard.
8. The points for every correct answer for each level are 10, 20 and 30 respectively.
9. The number of questions of the quiz is six, where 4 are going to be about the character and 2 about the director. 
10. The user will select the level at the beggining of the quiz and after answer the six question will receive the final score.

1. Acces the data (imdb files)

In [2]:
import pandas as pd 
import numpy as np

In [3]:
name_basics = pd.read_csv('data/name.basics.tsv', sep = '\t')
title_basics = pd.read_csv('data/title.basics.tsv', sep = '\t')

C:\Users\20152\AppData\Local\Temp\ipykernel_23244\600140999.py:2: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  title_basics = pd.read_csv('data/title.basics.tsv', sep = '\t')

In [4]:
name_basics.head()
# This is my data related with actors

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"actor,miscellaneous,producer","tt0050419,tt0072308,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"
3,nm0000004,John Belushi,1949,1982,"actor,writer,music_department","tt0072562,tt0077975,tt0080455,tt0078723"
4,nm0000005,Ingmar Bergman,1918,2007,"writer,director,actor","tt0050986,tt0069467,tt0083922,tt0050976"

In [5]:
title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Poor Pierrot,Pauvre Pierrot,0,1892,\N,5,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [7]:
title_crew = pd.read_csv('data/title.crew.tsv', sep = '\t')
title_ratings = pd.read_csv('data/title.ratings.tsv', sep = '\t')

In [8]:
title_crew.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [9]:
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2096
1  tt0000002            5.6       282
2  tt0000003            6.5      2115
3  tt0000004            5.4       182
4  tt0000005            6.2      2845

In [12]:
title_principals = pd.read_csv('data/title.principals.tsv', sep = '\t')

In [13]:
title_principals.head()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Self""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0005690,producer,producer,\N
3,tt0000001,4,nm0374658,cinematographer,director of photography,\N
4,tt0000002,1,nm0721526,director,\N,\N